

export async function getGovernanceTypes() {
  return Promise.resolve([
    {label: '通用' , value: '通用'},
    {label: '其他1' , value: '其他1'},
    {label: '其他2' , value: '其他2'},
  ]);
}


export async function getGovernanceMedicalRecordCategories() {
  return Promise.resolve([
    {label: "病案首页", value: "病案首页",},
    {label: "入院记录", value: "入院记录",},
    {label: "手术记录", value: "手术记录",},
    {label: "检查记录", value: "检查记录",},
    {label: "病理报告", value: "病理报告",},
    {label: "诊断归一", value: "诊断归一",},
    {label: "X光", value: "X光",},
    {label: "诊断推断", value: "诊断推断",},
  ]);
}


export async function getStructures(body) {
  return Promise.resolve({
    "基本信息": {
      "姓名": "张三",
      "性别": "男",
      "出生日期": "",
      "年龄": "28岁",
      "民族": "",
      "身份证号": "",
      "职业": "",
      "婚姻状况": "",
      "现住址": "",
      "户口地址": "",
      "联系电话": "",
      "工作单位及地址": "",
      "联系人姓名": "",
      "联系人关系": "",
      "联系人地址": ""
    },
    "入院信息": {
      "入院途径": "",
      "入院时间": "2025年4月9日",
      "入院科别": "",
      "入院诊断": [
        {
          "诊断名称": "急性胃肠炎（急性腹泻）",
          "诊断编码": "",
          "诊断时间": "2025年4月9日"
        }
      ],
      "入院情况": "患者于2天前无明显诱因出现腹泻，每日排便6至8次，粪便性状为稀水样，无粘液脓血，伴轻度腹痛，主要位于脐周和左下腹，呈间歇性绞痛，无发热、呕吐。无寒战、无明显脱水表现。自行口服蒙脱石散及口服补液盐后症状略缓解，今为进一步诊治前来就诊。"
    },
    "住院信息": {
      "住院天数": "",
      "病房": "",
      "转科科别": "",
      "住院期间抢救次数": "",
      "是否告病危或病重": ""
    },
    "出院信息": {
      "出院时间": "",
      "出院科别": "",
      "出院诊断": [],
      "治疗结果": ""
    },
    "疾病信息": [
      {
        "疾病名称": "急性胃肠炎（急性腹泻）",
        "诊断时间": "2025年4月9日",
        "疾病编码": "",
        "其他信息": ""
      }
    ],
    "检查信息": [
      {
        "检查项目": "粪常规",
        "检查结果": "未见脓细胞、红细胞",
        "检查时间": "2025年4月9日"
      },
      {
        "检查项目": "血常规",
        "检查结果": "白细胞计数正常，中性粒细胞略升高",
        "检查时间": "2025年4月9日"
      },
      {
        "检查项目": "电解质",
        "检查结果": "钾、钠轻度降低",
        "检查时间": "2025年4月9日"
      }
    ],
    "治疗信息": [
      {
        "治疗方法": "口服补液",
        "药物": "",
        "治疗开始时间": "2025年4月9日",
        "治疗持续时间": "",
        "剂量": "",
        "治疗结果": "",
        "否定词": ""
      },
      {
        "治疗方法": "蒙脱石散收敛止泻",
        "药物": "蒙脱石散",
        "治疗开始时间": "2025年4月9日",
        "治疗持续时间": "",
        "剂量": "",
        "治疗结果": "",
        "否定词": ""
      },
      {
        "治疗方法": "益生菌调节肠道菌群",
        "药物": "益生菌",
        "治疗开始时间": "2025年4月9日",
        "治疗持续时间": "",
        "剂量": "",
        "治疗结果": "",
        "否定词": "必要时"
      }
    ],
    "就诊情况": [
      {
        "就诊医院": "",
        "就诊时间": "2025年4月9日"
      }
    ],
    "其他信息": ""
  })
}
